Revit 2027 API
RebarShapeConstraintFixedSegmentDir Constructor
 Create a fixed segment direction constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintFixedSegmentDir(
	UV dir
)
Public Sub New (
	dir As UV
)
public:
RebarShapeConstraintFixedSegmentDir(
	UV^ dir
)
new :
        dir : UV -> RebarShapeConstraintFixedSegmentDir
Parameters
dir UV
 A fixed direction in UV-space.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  dir has zero length.
See Also
Reference
RebarShapeConstraintFixedSegmentDir Class
Autodesk.Revit.DB.Structure Namespace